Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If you need to do some integration testing against Keycloak then you are encouraged to do it with xref:integration-testing-keycloak-devservices[Dev Services For Keycloak]. Use `KeycloakTestResourceLifecycleManager` for your tests only if there is a good reason not to use `Dev Services for Keycloak`.
ja_jp: Keycloakとの統合テストが必要な場合は、 xref:integration-testing-keycloak-devservices[Dev Services For Keycloak] で行うことが推奨されます。 `Dev Services for Keycloak` を使用しない正当な理由がある場合にのみ、テストに `KeycloakTestResourceLifecycleManager` を使用してください。

source: If you need to do the integration testing against Keycloak then you are encouraged to do it with <<integration-testing-keycloak-devservices,Dev Services For Keycloak>>. Use `KeycloakTestResourceLifecycleManager` for your tests only if there is a good reason not to use `Dev Services for Keycloak`.
ja_jp: Keycloak に対して統合テストを行う必要がある場合は、<<integration-testing-keycloak-devservices,Dev Services For Keycloak>> で行うことをお勧めします。 `Dev Services for Keycloak` を使用しない正当な理由がある場合にのみ、テストに `KeycloakTestResourceLifecycleManager` を使用してください。

source: If you need to emit custom commands, you can either use the data sources (reactive or imperative) or the `io.vertx.mutiny.redis.client.Redis`.
ja_jp: カスタムコマンドを発行する必要がある場合は、データソース (リアクティブ型または命令型) または `io.vertx.mutiny.redis.client.Redis` を使用することができます。

source: If you need to enable or disable the exporter at runtime, you can use the xref:opentelemetry-tracing.adoc#sampler[sampler] because it has the ability to filter out all the spans if needed.
ja_jp: 実行時にエクスポーターを有効または無効にする必要がある場合は、必要に応じてすべてのスパンをフィルタリングできる xref:opentelemetry-tracing.adoc#sampler[sampler] を使用します。

source: If you need to enable the Quarkus OIDC extension at runtime, set `quarkus.oidc.tenant-enabled=false` at build time and then re-enable it at runtime by using a system property. For more information about managing the individual tenant configurations in multitenant OIDC deployments, see the _Disabling tenant configurations_ section in the xref:security-openid-connect-multitenancy.adoc#disable-tenant[Using OpenID Connect (OIDC) multi-tenancy] guide.
ja_jp: Quarkus OIDCエクステンションを実行時に有効にする必要がある場合は、ビルド時に `quarkus.oidc.tenant-enabled=false` 、システムプロパティを使用して実行時に再有効化します。マルチテナントOIDC展開における個々のテナント構成の管理に関する詳細は、『 link:security-openid-connect-multitenancy.html#disable-tenant[Using OpenID Connect（OIDC）』マルチテナンシーガイド] の「 _テナント構成の無効 _化」のセクションを参照してください。

source: If you need to generate resources for both platforms (vanilla Kubernetes and OpenShift), then you need to include both (comma separated).
ja_jp: 両方のプラットフォーム(バニラKubernetesとOpenShift)のリソースを生成する必要がある場合は、両方を含める必要があります(カンマ区切り)。

source: If you need to get more properties of the HTTP response than just the body, such as the status code or headers, you can make your method return `org.jboss.resteasy.reactive.RestResponse` from a method. An example of this could look like:
ja_jp: HTTP レスポンスのボディだけでなく、ステータスコードやヘッダーなどの他のプロパティーも取得する必要がある場合は、 メソッドから `org.jboss.resteasy.reactive.RestResponse` を返すことができます。 以下に例を示します。

source: If you need to have access to the full AWT support, you need more than just `libfreetype.so`, but also the font and font configurations:
ja_jp: AWTのフルサポートを利用する必要がある場合、 `libfreetype.so` だけでなく、フォント及びフォント設定も必要です:

source: If you need to have multiple constructors in your DTO, you must annotate the constructor intended to generate a SELECT clause with @ProjectedConstructor:
ja_jp: DTO に複数のコンストラクターが必要な場合は、SELECT 句を生成することを意図したコンストラクターに @ProjectedConstructor アノテーションを付ける必要があります。

source: If you need to implement a custom factory—such as to skip re-verifying tokens that have already been validated by a firewall—you can do so in one of the following ways:
ja_jp: ファイアウォールによってすでに検証されているトークンの再検証をスキップするなど、カスタムファクトリーを実装する必要がある場合は、次のいずれかの方法で実装できます。

source: If you need to implement a gRPC service or consume it, you need the `quarkus-grpc` extension. It handles both sides.
ja_jp: gRPC サービスを実装または使用する必要がある場合は、 `quarkus-grpc` エクステンションが必要です。 このエクステンションは、両側を処理します。

source: If you need to inject the same `ManagedExecutor` or `ThreadContext` into several places and share its capacity, you can name the instance with https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/NamedInstance.html[`@NamedInstance`] annotation. `@NamedInstance` is a CDI qualifier and all injections of the same type and name will therefore share the same underlying instance. If you also need to customize your instance, you can do so using `@ManagedExecutorConfig`/`ThreadContextConfig` annotation on one of its injection points:
ja_jp: 同じ `ManagedExecutor` や `ThreadContext` を複数の場所に注入し、その容量を共有したい場合、そのインスタンスに link:https://javadoc.io/doc/io.smallrye/smallrye-context-propagation-api/latest/io/smallrye/context/api/NamedInstance.html[`@NamedInstance`] アノテーションで名前を付けることが出来ます。 `@NamedInstance` はCDIアノテーションであり、同じ型と名前のすべての注入は、したがって、同じ基礎となるインスタンスを共有します。インスタンスをカスタマイズする必要がある場合は、インジェクションポイントの1つで `@ManagedExecutorConfig`/ `ThreadContextConfig` アノテーションを使用して、カスタマイズすることができます。

source: If you need to introspect the JWT tokens remotely, you can use either `quarkus-oidc` or `quarkus-elytron-security-oauth2` because they support the verification of the opaque or binary tokens by using remote introspection. `quarkus-smallrye-jwt` does not support the remote introspection of both opaque or JWT tokens but instead relies on the locally available keys that are usually retrieved from the OpenID Connect provider.
ja_jp: JWT トークンをリモートでイントロスペクションする必要がある場合は、 `quarkus-oidc` または `quarkus-elytron-security-oauth2` のいずれかを使用できます。これらはリモート イントロスペクションを使用した不透明なトークンまたはバイナリトークンの検証をサポートしているためです。 `quarkus-smallrye-jwt` は、不透明なトークンまたは JWT トークンの両方のリモートイントロスペクションをサポートしていませんが、その代わりに、通常は OpenID Connect プロバイダーから取得されるローカルで利用可能なキーに依存します。

source: If you need to make your build step conditional on the presence or absence of another extension, you can use <<capabilities>> for that.
ja_jp: 別のエクステンションの有無を条件としてビルドステップを作成する必要がある場合は、<<capabilities>> を使用できます。

source: If you need to make your build step conditional on the presence or absence of another extension, you can use xref:capabilities[Capabilities] for that.
ja_jp: ビルドステップを他のエクステンションの有無で条件付ける必要がある場合、 xref:capabilities[ケイパビリティ] を使用できます。

source: If you need to migrate from Quarkus 2.16.x please beware that configuration properties are different and you should check the older Quarkus OpenTelemetry guide version, https://quarkus.io/version/2.16/guides/opentelemetry#configuration-reference[here].
ja_jp: Quarkus 2.16.x から移行する必要がある場合は、設定プロパティーが異なることに注意してください。 https://quarkus.io/version/2.16/guides/opentelemetry#configuration-reference[こちら] から、古いバージョンの Quarkus OpenTelemetry ガイドを確認する必要があります。

source: If you need to mock entity instance methods, such as `persist()` you can do it by mocking the Hibernate ORM `Session` object:
ja_jp: `persist()` のようなエンティティインスタンスのメソッドをモックにする必要がある場合は、Hibernate ORMの `Session` オブジェクトをモック化することで実現できます:

source: If you need to mock entity instance methods, such as `persist()` you can do it by mocking the Hibernate Reactive `Mutiny.Session` object:
ja_jp: `persist()` のようなエンティティインスタンスのメソッドをモックにする必要がある場合は、Hibernate Reactive `Mutiny.Session` オブジェクトをモック化することで実現できます:

source: If you need to optimize the performance for write operations by reducing the total number of invalidation messages, enable bloom filter. Bloom filters reside on Infinispan Server and keep track of the entries that the client has requested. They cannot be used with unbounded near cache: maximum number of entries must be defined when enabling bloom filters.
ja_jp: 無効化メッセージの総数を減らすことで書き込み操作のパフォーマンスを最適化する必要がある場合はブルームフィルタを有効にします。ブルームフィルタは Infinispan サーバー に常駐し、クライアントが要求したエントリを追跡します。 これらは、境界付けられていないニアキャッシュでは使用できません。ブルームフィルタを有効にする際には、エントリの最大数を定義する必要があります。

source: If you need to override the default `OpenShiftClient`, provide a producer such as:
ja_jp: デフォルトの `OpenShiftClient` を上書きする必要がある場合は、次のようなプロデューサーを提供してください。

source: If you need to permit access to the `/forbidden/` path, please add new permission with more specific exact path like in the example below:
ja_jp: `/forbidden/` パスへのアクセスを許可する必要がある場合は、以下の例のように、より具体的な正確なパスを使用して新しい権限を追加してください。

source: If you need to propagate your transaction context across your reactive pipeline, please see the xref:context-propagation.adoc[Context Propagation guide].
ja_jp: トランザクションコンテキストをリアクティブパイプラインに伝播させる必要がある場合は、 link:context-propagation.html[Context Propagationガイド]を参照してください。

source: If you need to provide your own factory, for example, to avoid verifying the tokens again which have already been verified by the firewall, then you can either use a `ServiceLoader` mechanism by providing a `META-INF/services/io.smallrye.jwt.auth.principal.JWTCallerPrincipalFactory` resource or simply have an `Alternative` CDI bean implementation like this one:
ja_jp: たとえば、ファイアウォールによってすでに検証されているトークンの再検証を回避するために独自のファクトリーを提供する必要がある場合は、 `META-INF/services/io.smallrye.jwt.auth.principal.JWTCallerPrincipalFactory` リソースを提供すして `ServiceLoader` メカニズムを使用するか、単純に次のような `Alternative` CDI Bean 実装を持つことができます。

source: If you need to react to change of the health status of your application, the Smallrye Health extension provides a CDI event that can notify you about the individual health status changes.
ja_jp: アプリケーションのヘルスステータスの変化に対応する必要がある場合、Smallrye Healthエクステンションは、個々のヘルスステータスの変化を通知するCDIイベントを提供します。

source: If you need to register an `org.bouncycastle.jcajce.provider.BouncyCastleFipsProvider` JCE provider then please set a `BCFIPS` provider name:
ja_jp: `org.bouncycastle.jcajce.provider.BouncyCastleFipsProvider` JCE プロバイダを登録する必要がある場合は、 `BCFIPS` というプロバイダ名を設定してください。 :

source: If you need to register an `org.bouncycastle.jce.provider.BouncyCastleProvider` JCE provider then please set a `BC` provider name:
ja_jp: `org.bouncycastle.jce.provider.BouncyCastleProvider` JCE プロバイダを登録する必要がある場合は、 `BC` プロバイダ名を設定してください :

source: If you need to register an `org.bouncycastle.jsse.provider.BouncyCastleJsseProvider` JSSE provider and use it in combination with `org.bouncycastle.jcajce.provider.BouncyCastleFipsProvider` instead of the default SunJSSE provider then please set a `BCFIPSJSSE` provider name:
ja_jp: デフォルトのSunJSSEプロバイダではなく、 `org.bouncycastle.jsse.provider.BouncyCastleJsseProvider` JSSEプロバイダを登録して、 `org.bouncycastle.jcajce.provider.BouncyCastleFipsProvider` と組み合わせて使用する必要がある場合は、 `BCFIPSJSSE` というプロバイダ名を設定してください。 :

source: If you need to register an `org.bouncycastle.jsse.provider.BouncyCastleJsseProvider` JSSE provider and use it instead of the default SunJSSE provider then please set a `BCJSSE` provider name:
ja_jp: `org.bouncycastle.jsse.provider.BouncyCastleJsseProvider` JSSE プロバイダを登録して、デフォルトの SunJSSE プロバイダの代わりに使用する必要がある場合は、 `BCJSSE` というプロバイダ名を設定してください。 :

source: If you need to reimport the data, you'll need to clear the previously imported data, otherwise you'll get errors. You can clear the previously imported data by executing:
ja_jp: データを再インポートする必要がある場合は、以前にインポートされたデータをクリアする必要があります。そうしないとエラーが発生してしまいます。以前にインポートしたデータをクリアするには、次のように実行します。

source: If you need to render the unescaped value:
ja_jp: エスケープされていない値をレンダリングする必要がある場合:

source: If you need to schedule a job programmatically you'll need to add the xref:quartz.adoc[Quartz extension] and use the Quartz API directly.
ja_jp: プログラムでジョブをスケジュールする必要がある場合は、 link:quartz[Quartzエクステンション] を追加してQuartz APIを直接使用する必要があります。

source: If you need to send a Kafka record, use:
ja_jp: Kafka レコードを送信する必要がある場合は、次を使用します。

source: If you need to set custom HTTP headers and / or the HTTP response, then you can return `org.jboss.resteasy.reactive.RestMulti` instead, like this:
ja_jp: カスタムHTTPヘッダーやHTTPレスポンスを設定する必要がある場合は、代わりに次のように `org.jboss.resteasy.reactive.RestMulti` を返却します ：

source: If you need to set more properties on the HTTP response than just the body, such as the status code or headers, you can make your method return `org.jboss.resteasy.reactive.RestResponse` from a resource method. An example of this could look like:
ja_jp: ステータスコードやヘッダーなど、本文だけでなく HTTP レスポンスに多くのプロパティーを設定する必要がある場合は、リソースメソッドからメソッドに `org.jboss.resteasy.reactive.RestResponse` を返すようにすることができます。この例は次のようになります。

source: If you need to sign and/or encrypt the token using the symmetric secret key then consider using `io.smallrye.jwt.util.KeyUtils` to generate a SecretKey of the required length.
ja_jp: 対称秘密鍵を使用してトークンに署名および/または暗号化する必要がある場合は、 `io.smallrye.jwt.util.KeyUtils` を使用して必要な長さの秘密鍵を生成することを検討してください。

source: If you need to sign or encrypt the token by using the symmetric secret key, consider using `io.smallrye.jwt.util.KeyUtils` to generate a `SecretKey` of the required length.
ja_jp: 対称秘密鍵を使用してトークンに署名または暗号化する必要がある場合は、 `io.smallrye.jwt.util.KeyUtils` を使用して必要な長さの `SecretKey` を生成することを検討してください。

source: If you need to use `mongo+srv://` in native mode, you can configure an alternative DNS resolver. This feature is **experimental** and may introduce a difference between JVM applications and native applications.
ja_jp: `mongo+srv://` をネイティブモードで使用する必要がある場合は、代替の DNS リゾルバを設定することができます。この機能は *実験的な*もので、JVMアプリケーションとネイティブアプリケーションの間に違いが生じる可能性があります。

source: If you need to use a custom sampler or to use one that is provided by one of the https://github.com/open-telemetry/opentelemetry-java/tree/main/sdk-extensions[OpenTelemetry SDK Extensions] you can create a sampler producer. The OpenTelemetry extension will detect the `Sampler` CDI bean and will use it when configuring the tracer producer.
ja_jp: カスタムサンプラーを使用する必要がある場合や、 link:https://github.com/open-telemetry/opentelemetry-java/tree/main/sdk-extensions[OpenTelemetry SDK Extensions]の1つが提供するサンプラーを使用する必要がある場合は、サンプラー・プロデューサーを作成することができます。OpenTelemetryエクステンションは、 `Sampler` CDI Beanを検出し、トレーサープロデューサーを構成する際にそれを使用します。

source: If you need to use a custom sampler there are now 2 different ways:
ja_jp: カスタムサンプラーを使用する必要がある場合、現在2種類の方法があります:

source: If you need to use a different Elasticsearch or OpenSearch image than the default one you can configure it via:
ja_jp: デフォルトとは異なるElasticsearchやOpenSearchのイメージを使用する必要がある場合は、以下の方法で設定することができます：

source: If you need to use a different image than the default one you can configure it via:
ja_jp: デフォルトのイメージと異なるイメージを使用する必要がある場合、以下の方法で設定できます。

source: If you need to use https://docs.aws.amazon.com/elasticsearch-service/[Amazon’s managed Elasticsearch service], you will find it requires a proprietary authentication method involving request signing.
ja_jp: link:https://docs.aws.amazon.com/elasticsearch-service/[Amazonが管理するElasticsearchサービス]を使用する必要がある場合、リクエストの署名を含む独自の認証方法を必要になります。

source: If you need to verify the token signature by using the asymmetric RSA or Elliptic Curve (EC) key, use the `mp.jwt.verify.publickey.location` property to refer to the local or remote verification key.
ja_jp: 非対称 RSA または楕円曲線 (EC) 鍵を使用してトークンの署名を検証する必要がある場合は、 `mp.jwt.verify.publickey.location` プロパティーを使用してローカルまたはリモートの検証鍵を参照します。

source: If you need to verify the token signature by using the symmetric secret key, then either a `JSON Web Key` (JWK) or `JSON Web Key Set` (JWK Set) format must be used to represent this secret key, for example:
ja_jp: 対称秘密鍵を使用してトークン署名を検証する必要がある場合は、JSON Web 鍵 (JWK) または JSON Web 鍵セット (JWK セット) 形式のいずれかを使用して、この秘密鍵を表す必要があります。以下はその例です。

source: If you need to verify the token signature using the assymetric RSA or Elliptic Curve (EC) key then use the `mp.jwt.verify.publickey.location` property to refer to the local or remote verification key.
ja_jp: 非対称 RSA または楕円曲線 (EC) 鍵を使用してトークンの署名を検証する必要がある場合は、 `mp.jwt.verify.publickey.location` プロパティーを使用してローカルまたはリモートの検証鍵を参照します。

source: If you need to verify the token signature using the asymmetric RSA or Elliptic Curve (EC) key then use the `mp.jwt.verify.publickey.location` property to refer to the local or remote verification key.
ja_jp: 非対称 RSA または楕円曲線 (EC) 鍵を使用してトークンの署名を検証する必要がある場合は、 `mp.jwt.verify.publickey.location` プロパティーを使用してローカルまたはリモートの検証鍵を参照します。

source: If you need to verify the token signature using the symmetric secret key then either a `JSON Web Key` (JWK) or `JSON Web Key Set` (JWK Set) format must be used to represent this secret key, for example:
ja_jp: 対称秘密鍵を使用してトークン署名を検証する必要がある場合は、JSON Web 鍵 (JWK) または JSON Web 鍵セット (JWK セット) 形式のいずれかを使用して、この秘密鍵を表す必要があります。以下はその例です。

source: If you need to write accessors, you can:
ja_jp: アクセサを書く必要がある場合は、以下のようにできます。

source: If you need you can also create new `OidcClient` programmatically like this:
ja_jp: 必要であれば、このようにプログラム的に新しい `OidcClient` を作成することもできます。

source: If you need you can disable encrypting the tokens in the session cookie with `quarkus.oidc.token-state-manager.encryption-required=false`.
ja_jp: 必要であれば、 `quarkus.oidc.token-state-manager.encryption-required=false` を使ってセッション・クッキー内のトークンの暗号化を無効にすることができます。

source: If you need your spans and logs to be exported directly as they finish (e.g. in a serverless environment / application), you can set this property to `true`. This replaces the default batching of data.
ja_jp: スパンとログを完了と同時に直接エクスポートする必要がある場合 (サーバーレス環境やアプリケーションなど)、このプロパティーを `true` に設定できます。これにより、データのデフォルトのバッチ処理が置き換えられます。

source: If you notice the `RemoteCache` declaration has an additional annotation named `Remote`. This is a *qualifier* annotation allowing you to specify which named cache that will be injected. This annotation is not required and if it is not supplied, the default cache will be injected. The RemoteCacheManager and RemoteCache bean scope is `@ApplicationScoped`.
ja_jp: `RemoteCache` 宣言に `Remote` というアノテーションが追加されていることにお気づきでしょう。これは *修飾子* アノテーションで、注入する名前付きキャッシュを指定します。このアノテーションは必須ではなく、指定しないと、既定のキャッシュが注入されます。RemoteCacheManager および RemoteCache ビーンのスコープは `@ApplicationScoped` です。

source: If you notice the `RemoteCache` declaration has an additional annotation named `Remote`. This is a *qualifier* annotation allowing you to specify which named cache that will be injected. This annotation is not required and if it is not supplied, the default cache will be injected. The RemoteCacheManager bean scope is `@ApplicationScope`. The RemoteCache bean scope is `@Singleton`.
ja_jp: `RemoteCache` の宣言に、 `Remote` というアノテーションが追加されていることにお気づきでしょうか。これは修飾子 *アノテーション* で、注入される名前付きキャッシュを指定できます。このアノテーションは必須ではなく、指定しないとデフォルトのキャッシュが注入されます。RemoteCacheManager Bean スコープは `@ApplicationScope` です。RemoteCache Bean スコープは `@Singleton` です。

source: If you notice the `RemoteCache` declaration has an additional optional annotation named `Remote`. This is a qualifier annotation allowing you to specify which named cache that will be injected. This annotation is not required and if it is not supplied, the default cache will be injected.
ja_jp: `RemoteCache` 宣言に `Remote` というオプションのアノテーションが追加されていることにお気づきでしょうか。これは、注入される名前付きキャッシュを指定するための修飾子アノテーションです。このアノテーションは必須ではなく、指定しなかった場合はデフォルトのキャッシュが注入されます。

source: If you now rerun the health check at `http://localhost:8080/q/health/live` the `checks` array will contain only the previously defined `SimpleHealthCheck` as it is the only check defined with the `@Liveness` qualifier. However, if you access `http://localhost:8080/q/health/ready` (in the browser or with `curl http://localhost:8080/q/health/ready`) you will see only the `Database connection health check` as it is the only health check defined with the `@Readiness` qualifier as the readiness health check procedure.
ja_jp: `http://localhost:8080/q/health/live` のヘルスチェックを再実行すると、 `checks` の配列には、以前に定義した `SimpleHealthCheck` のみが含まれます。これは `@Liveness` という修飾子で定義された唯一のチェックだからです。しかし、次のようにアクセスすると `http://localhost:8080/q/health/ready` (ブラウザや `curl http://localhost:8080/q/health/ready`)にアクセスすると、 `Database connection health check` のみが表示されます。これは、Readinessヘルスチェック手順として `@Readiness` の修飾子で定義された唯一のヘルスチェックだからです。

source: If you now rerun the readiness health check (at `http://localhost:8080/q/health/ready`) the overall `status` should be DOWN. You can also check the liveness check at `http://localhost:8080/q/health/live` which will return the overall `status` UP because it isn't influenced by the readiness checks.
ja_jp: 再度、Readinessヘルスチェック `http://localhost:8080/q/health/ready`)を再実行すると、全ての `status` がDOWNするはずです。また、以下の場所でlivenessチェックを行うこともできます。 `http://localhost:8080/q/health/live`この場合、全体の `status` はUPです。これは、Readinessチェックの影響を受けないためです。

source: If you only have a single JDBC extension, or you are running tests and only have a single test scoped JDBC extension installed then this is optional. If there is only one possible extension we assume this is the correct one, and if a driver has been added with test scope then we assume that this should be used in testing.
ja_jp: JDBCエクステンションが1つしかない場合や、テストを実行していてテストスコープ付きのJDBCエクステンションが1つしかインストールされていない場合は、これはオプションです。利用可能なエクステンションがひとつしかない場合は、それが正しいものであると仮定します。また、テストスコープでドライバが追加されている場合は、それをテストで使用すべきであると仮定します。

source: If you only need to run in-memory scheduler use the xref:scheduler.adoc[Scheduler] extension.
ja_jp: インメモリーのスケジューラーを実行するだけであれば、 link:scheduler.html[Scheduler]エクステンションを使用してください。

source: If you only want to apply this logo to swagger-ui (and not globally to all UIs) call the file `smallrye-open-api-ui.png` rather than `logo.png`.
ja_jp: このロゴをswagger-uiだけに適用したい（すべてのUIにグローバルに適用したくない）場合は、 `logo.png` ではなく `smallrye-open-api-ui.png` というファイルを呼び出します。

source: If you only want to apply this style to swagger-ui (and not globally to all UIs) call the file `smallrye-open-api-ui.css` rather than `style.css`.
ja_jp: このスタイルをswagger-uiだけに適用したい（すべてのUIにグローバルに適用したくない）場合は、 `style.css` ではなく `smallrye-open-api-ui.css` というファイルを呼び出します。

source: If you only want to use the WebSocket client you should include `quarkus-websockets-client` instead.
ja_jp: WebSocketクライアントのみを使用したい場合は、代わりに `quarkus-websockets-client` を含める必要があります。

source: If you open the `pom.xml` or `build.gradle` build file of the generated project you'll see that the project is similar to any other Quarkus project. The `quarkus-azure-functions-http` extension is the integration point between Quarkus and Azure Functions.
ja_jp: 生成されたプロジェクトの `pom.xml` または `build.gradle` ビルドファイルを開くと、 このプロジェクトは他の Quarkus プロジェクトと同様であることがわかります。 `quarkus-azure-functions-http` エクステンションは、 Quarkus と Azure Functions のインテグレーションポイントです。

source: If you open the `pom.xml` or `build.gradle` build file of the generated project you'll see that the project is similar to any other Quarkus project. The `quarkus-azure-functions` extension is the integration point between Quarkus and Azure Functions. It registers callback with the Azure Functions runtime to bootstrap Quarkus and to set up Quarkus/Arc as the function factory for your function classes.
ja_jp: 生成されたプロジェクトの `pom.xml` または `build.gradle` ビルドファイルを開くと、 このプロジェクトは他の Quarkus プロジェクトと同様であることがわかります。 `quarkus-azure-functions` エクステンションは、 Quarkus と Azure Functions のインテグレーションポイントです。これにより、Azure Functions ランタイムにコールバックが登録され、Quarkus をブートストラップし、 Quarkus/Arc を関数クラスの関数ファクトリーとしてセットアップします。

source: If you open the `pom.xml` or `build.gradle` build file of the generated project, you'll see that the project is similar to any other Quarkus project. The `quarkus-azure-functions` extension is the integration point between Quarkus and Azure Functions. It registers callbacks with the Azure Functions runtime to bootstrap Quarkus and to set up Quarkus/ArC as the function factory for your function classes.
ja_jp: 生成されたプロジェクトの `pom.xml` または `build.gradle` ビルドファイルを開くと、そのプロジェクトが他の Quarkus プロジェクトと同様であることがわかります。`quarkus-azure-functions` エクステンションは、Quarkus と Azure Functions の間の統合ポイントです。これは、Azure Functions ランタイムにコールバックを登録して Quarkus をブートストラップし、Quarkus/ArC を関数クラスの関数ファクトリーとして設定します。

source: If you open the application's configuration file (`src/main/resources/application.properties`), you can see the following line:
ja_jp: アプリケーションの設定ファイル ( `src/main/resources/application.properties` ) を開くと、以下の行が存在します:

source: If you open the generated build file, you can see the selected extensions:
ja_jp: 生成されたビルドファイルを開くと、選択されたエクステンションが表示されます:
